# Test Connection to DB

In [ ]:
#%pip install -q sqlalchemy

## Import Libraries

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Connect to DB

In [2]:
# for postgreSQL database credentials can be written as 
user = 'myuser'
password = 'mypassword'
host = 'localhost'
port = '5432' # 5433
database = 'eie'
# for creating connection string
connection_str = f"postgresql://{user}:{password}@{host}:{port}/{database}"
# SQLAlchemy engine
engine = create_engine(connection_str)
# you can test if the connection is made or not
try:
    with engine.connect() as connection_str:
        print('Successfully connected to the PostgreSQL database')
except Exception as ex:
    print(f'Sorry failed to connect: {ex}')

Successfully connected to the PostgreSQL database

## Query Examples

In [3]:
# Number of students that took test by year and by gender
# Needed columns:outid, sextypename, year -> from students
query = """
SELECT years, sextypename,  COUNT(outid) as NUM FROM students
GROUP BY years, sextypename
ORDER BY years, sextypename;
"""
df = pd.read_sql(query, engine)
df

    years sextypename     num
0    2016      Female  141626
1    2016        Male  126376
2    2017      Female  127637
3    2017        Male  113252
4    2018      Female  168582
5    2018        Male  167105
6    2019      Female  175647
7    2019        Male  178166
8    2020      Female  187488
9    2020        Male  191811
10   2021      Female  193073
11   2021        Male  196250
12   2022      Female  122311
13   2022        Male  111793
14   2023      Female  148941
15   2023        Male  139994

In [10]:
# Number of students that took tests by region by year
query = """
SELECT region, years, COUNT(outid) FROM (
    SELECT students.outid, students.years, locations.english_name as region FROM students
    INNER JOIN locations ON CONCAT(SUBSTRING(students.KATOTTG_2023_school, 3, 2), '00000000')=locations.KOATUU_2020
    WHERE starts_with(students.KATOTTG_2023_school, 'UA')
)
GROUP BY region, years
ORDER BY region, years;
"""
df = pd.read_sql(query, engine)
df

          region  years  count
0      Cherkaska   2016   8078
1      Cherkaska   2017   7234
2      Cherkaska   2018   8733
3      Cherkaska   2019   9099
4      Cherkaska   2020  11216
..           ...    ...    ...
195  Zhytomyrskа   2019  11757
196  Zhytomyrskа   2020  12508
197  Zhytomyrskа   2021  12933
198  Zhytomyrskа   2022   8108
199  Zhytomyrskа   2023  10402

[200 rows x 3 columns]

In [11]:
# pandas transfor table to pivot table
df.pivot(index='region', columns='years', values='count')

years              2016   2017   2018   2019   2020   2021   2022   2023
region
Cherkaska          8078   7234   8733   9099  11216  10853   6967   8962
Chernihivska       7557   6777   8533   8471   9047   8978   6054   7155
Chernivetska       6804   6095   8981   8980   9457   9603   5153   6869
Dnipropetrovska   21725  19207  24800  29263  31833  32479  20859  23610
Donetska          11427  10238  14365  15098  16235  16211   6284   5240
Ivano-Frankivska   9381   8396  12948  13556  14770  15484   9161  12023
Kharkivska        16901  15329  21251  21644  23706  24311  13715  16305
Khersonska         8190   7032   9190   9781  10248  10352   2300   2529
Khmelnytska        8896   7918  11756  11641  11917  12641   8345  10820
Kirovohradska      6652   5797   7889   8026   8779   8255   5560   6701
Kyiv              20086  19604  28432  30202  32407  33735  24428  30568
Kyivska           12385  10651  12972  13543  15331  16676  12550  14253
Luhanska           4314   3909   5880   5828   6079   5941   1528   1155
Lvivska           17365  16125  21393  25537  27063  28250  18857  23216
Mykolaivska        7509   6784   9689   9614  10357  10492   5466   6914
Odeska            15920  14799  20651  22313  23545  24569  15195  18263
Poltavska          9937   8839  11749  12470  13077  12800   8501  11311
Rivnenska         10408   9287  12883  12765  13837  14657   8903  11081
Sumska             7372   6468   9334   9334   9798  10083   6634   8308
Ternopilska        6719   5785  10278  10367  10754  11139   7227   9247
Vinnytska         11084   9368  14671  15584  16209  16250  10512  12876
Volynska           8245   7256  11192  11295  11925  12664   7728  10411
Zakarpatska        9478   9176  11824  12293  12916  13327   6711   8406
Zaporizka         12001  10597  14585  15352  16285  16640   7358   8616
Zhytomyrskа        9568   8218  11708  11757  12508  12933   8108  10402